#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/*
	Η συνάρτηση get_Sudoku δέχεται ένα char*, που είναι το δεύτερο όρισμα που δώθηκε στην γραμμή εντολών (πρώτο είναι το όνομα του εκτελέσημου)
	και ανοίγει το αρχείο κειμένου, αντιγράφει όλα τα στοιχεία από το αρχείο σε έναν δυναμικά δεσμευμένο δισδιάστατο πίνακα, και κλείνει το αρχείο.
	Ακόμα καταγράφει τον αριθμό από γραμμές και τον αριθμό από στήλες που δέχεται η validate_Sudoku. Άμα το αρχείο δεν ανοίγει, εκτυπώνει κατάλληλο μήνυμα
	και τερματίζει το πρόγραμμα. Έπειτα καλεί την validate_Sudoku για να βεβαιωθεί ότι είναι σωστή η μορφή του Sudoku, και επιστρέφει τον
	πίνακα Α άμα τρέξει επιτυχώς. 
*/


char **get_Sudoku(char*);

/*
	Η συνάρτηση validate_Sudoku δέχεται ως παραμέτρους τον πίνακα Α, και τον αριθμό από στήλες και γραμμές όπου κατέληξαν οι μεταβλητές i και j 
	κατά την ανάγνωση στοιχείων από το αρχείο κειμένου. Με τις μεταβλητές αυτές ελέγχει άμα υπάρχει ο σωστός αριθμός από γραμμές και στήλες για ένα 9Χ9
	sudoku, και άμα δεν υπάρχουν ενημερώνει τον χρήστη πριν τερματίσει τον κώδικα. 'Επειτα εκτελεί τις συναρτήσεις validate_Cols, validate_Rows 
	και validate_Box για κάθε μη μηδενική τιμή που περιέχει ο πίνακας.
*/

void validate_Sudoku(char**, int, int);

/* 
	Η συνάρτηση validate_Cols δέχεται τον πίνακα Α, και τις θέσεις του τρέχοντος στοιχείου. Κρατάει σταθερό το στοιχείου της στήλης και 
	περνάει από κάθε στοιχείο της, ώστε να εντοπίσει πιθανά διπολότυπα. Αγνωεί το τρέχων στοιχείο όσο κάνει τις συγκρίσεις του και
	ειστρέφει μήνυμα άμα βρεθέι διπλότυπο εκτυπώνει κατάλληλο μήνυμα πριν επιστρέψει 0 για αποτυχία. Κατά την επιτυχία επιστρέφει 1.

*/

int validate_Cols(char**,int,int);

/*
	Η συνάρτηση validate_Rows δέχεται τον πίνακα Α και τις θέσεις του τρέχοντος στοιχείου. Εκτελεί την ίδια λειτουργεία με την 
	validate_Cols, απλά για τις γραμμές, οπότε κρατάει σταθερό τον δείκτη των γραμμών όσο περνάει από κάθε στοιχείο.

*/

int validate_Rows(char**,int,int);

/*
	Η συνάρτηση validate_Box δέχεται τον πίνακα Α και τις θέσεις του τρέχοντος στοιχείου. Με την διαίρεση και έπειτα τον 
	πολλαπλασιασμό με το 3, το ακέραιο αποτέλεσμα είναι πάντα η πρώτη γραμμή και η πρώτη στήλη τοθυ κουτιού 3Χ3 που θέλουμε να 
	ελέγξουμε. Γνωρίζοντας τις τιμές αυτές κοιτάει όλα τα στοιχεία στις συντεταγμένες αυτές και τις επόμενες δύο στήλες και γραμμες.
	Ο έλεγχος αγνωεί την τρέχων τιμή και άμα παρατηρήσει διπλότυπο, εκτυπώνει κατάλληλο μήνυμα πριν επιστρέψει 0 για αποτυχία. 
	Κατά την επιτυχία επιστρέφει 1

*/

int validate_Box(char**,int,int);

/*
	Η συνάρτηση solve_Sudoku δέχεται τον πίνακα Α. Περνάει από κάθε στοιχείο του sudoku μέχρι να βρει το 0. Στην περίπτωση που βρεθεί,
	Διασχεί τα στοιχεία 1 έως 9 για να βρει ένα που τηρεί τις απαιτήσεις των συναρτήσεων validate και καλεί αναδρομικά τον ευατό της.
	Άμα επιτύχει η αναδρομή, επιστρέφει το 1, και συνεχίζει να διασχίζει τον πίνακα για να βρει άλλα κελιά που περιέχουν το 0 και 
	να επαναλάβει την διαδικασία. Όταν δεν υπάρχουν άλλα μηδενικά τερματίζει η συνάρτηση και επιστρέφει 1. Όμως στην περίπτωση που
	κατά την αναδρομή δεν υπάρχει καμία επιλογή που να τηρεί τις προϋποθέσεις του παιχνιδιού, επιστρέφει στο προηγούμενο κελί και δοκιμάζει 
	νέο αριθμό, μέχρι να τους δοκιμάσει όλους, ή να βρεθεί αποδεκτή λύση. Άμα δεν βρεθεί αποδεκτή λύση, ο αλγόριθμος θα επιστρέψει ένα ακόμα
	κελί πιο πάνω και θα συνεχίσει να αλλάζει στοιχεία μέχρι να βρει το κελί που προκαλεί το πρόβλημα και να συνεχίσει κανονικά, ή να
	μείνει από επιλογές. Άμα μείνει από επιλογές, τότε το sudoku δεν λύνεται, και η συνάρτηση θα επιστρέψει 0.
	
	
*/

int solve_Sudoku(char**);

int main(int argc, char *argv[]){
	
	if(argc == 2){
		char ** A = get_Sudoku(argv[1]);
		if(solve_Sudoku(A)){
			
		}else{
			printf("Το Sudoku που δώθηκε δεν έχει έγκυρη λύση.\n");
			exit(1);
		}
	}
	else{
		printf("Δεν έχει συμπληρωθεί ο κατάλληλος αριθμός από ορίσματα. Απαιτούνται 2, υπάρχουν %d.\n",argc);	
		exit(1);
	}
	
	
	return 0;	
}


int solve_Sudoku(char** A){
		
	for(int i = 0; i < 9; i++){
		for(int j = 0; j < 9; j++){
			
			if(A[i][j] == '0'){
				
				for(char val = '1'; val <= '9';val++){
					A[i][j] = val;
					
					if(validate_Cols(A,i,j) && validate_Rows(A,i,j) && validate_Box(A,i,j)){
						if(solve_Sudoku(A)){
							return 1;	
						}
					}
					A[i][j] = '0';
				}
				return 0;
			}
		}
	}
	return 1;
}

char **get_Sudoku(char* arg){
	
	char **A = (char**)malloc(sizeof(char*)*9);
	for(int i = 0; i < 9; i++){
		A[i] = (char*)malloc(sizeof(char)*9);	
	}
	
	FILE *file = fopen(arg,"r");
	if(file == NULL){
		printf("Δεν άνοιξε το αρχείο.\n");
		exit(1);
	}
	int col = 0, row = 0, ch;
	while((ch = fgetc(file)) != EOF){
		if(ch == '\n'){
			continue;	
		}
		A[row][col] = (char)ch;
		col++;
		if(col == 9){
			col = 0;
			row++;
			
		}
			
	}
	validate_Sudoku(A,row,col);
	
	return A;
}


void validate_Sudoku(char** A, int row, int col){
	char ch;
	int check;
	
	if(row < 8){
		printf("Το αρχείο δεν περιέχει 9 γραμμές, αλλά μόνο %d.\n",col);
		exit(1);
	}else if(col != 0){
		printf("Το αρχείο δεν περιέχει τον απαιτούμενο αριθμό από στοιχεία, δηλαδή 81, αλλά μόνο %d.\n",(81-(9-row)));
		exit(1);
	}
	
	for(int i = 0; i < 9; i++){
		for(int j = 0; j < 9; j++){
			if((ch = A[i][j])!= '0'){
				
				if(!(check = validate_Cols(A,i,j))){
					printf("Η στήλη %d έχει τουλάχιστον δύο φορές το %c, άρα ο πίνακας δεν είναι έγκυρο Sudoku.\n",j+1,ch);
					exit(1);	
				}
				if(!(check = validate_Rows(A,i,j))){
					printf("Η γραμμή %d έχει τουλάχιστον δύο φορές το %c, άρα ο πίνακας δεν είναι έγκυρο Sudoku.\n",i+1,ch);
					exit(1);	
				}
				if(!(check = validate_Box(A,i,j))){
					printf("Το 3Χ3 κουτί που εμπεριέχει το κελί της γραμμής %d και της στήλης %d περιέχει τουλάχιστον δύο φορές το %c, άρα δεν είναι έγκυρος πίνακας Sudoku.\n",i+1,j+1,ch);
					exit(1);
				}
			}
		}	
	}
	
	
}



int validate_Cols(char **A, int row, int col){
	char ch = A[row][col];
	for(int i = 0; i<9; i++){
		if(i == row) continue;
		if(A[i][col] == ch) return 0;	
	}
	return 1;
	
}

int validate_Rows(char **A, int row, int col){
	char ch = A[row][col];
	for(int i = 0; i<9; i++){
		if(i == col) continue;
		if(A[row][i] == ch) return 0;
	}
	return 1;
}

int validate_Box(char** A, int row, int col){
	char ch = A[row][col];
	int rowGr = row / 3;
	int colGr = col / 3;
	
	rowGr = rowGr * 3;
	colGr = colGr * 3;
	
	for(int i = rowGr; i < rowGr + 3; i++){
		for(int j = colGr; j < colGr + 3; j++){
			if(j == col && i == row) continue;
			if(ch == A[i][j]) return 0;
		}	
	}
	
	return 1;
}

